using System;
using System.Globalization;
using System.Numerics;
using System.Runtime.InteropServices;

class ASD
{
    static void Main(string[] args)
    {
        /* 1) input --> розмір матриці N та M 
         * 
         * 2) вивід самої матриці у консоль
         * 
         * 3) алгоритм з обходом матриці
         * 
         * 4) вивід значень комірок матриці відповідно до шляху обходу нижньої половини матриці
         * 
         * 5) вивід максимального значення нижньої половини матриці
         * 
         * 6) алгоритм з порівнянням максимального числа нижньої половини матриці
         * з всіми значеннями перхньої половини (відповідно до шляху обходу)
         * 
         * 7) вивід значень відповідно до шляху обходу вернньої половини матриці
         * 
         * 8) вивід значень верхньої половини матриці які менше за максимальне
         * значення нижньої половини матриці
         */
    }

}
